# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   - **Only one challenge is mandatory, you can pick your favorite**
   - **Please always use relative paths to access the data**
  
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here

import pandas as pd
import numpy as np

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset.
Download the dataset from [here](https://drive.google.com/file/d/1Ycqn6b9vkBAhYRVo9LAiHxKtWaBoJLVi/view?usp=sharing) and place it in the data folder

#### First import the dataset into a dataframe called `temp`.

In [5]:
# your code here
temp = pd.read_csv("Temp_States.csv")
temp.shape

(7, 3)

#### Print `temp`.

In [6]:
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [13]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
City & State columns are objects as expected and temp column's dtype is float as it can be seen above.
"""

#### Select the rows where state is New York.

In [17]:
# your code here
state_ny = temp[temp["State"]=="New York"]
state_ny

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [20]:
# your code here
state_ny["Temperature"].mean()
print(f'Average temperature in cities of New York is {state_ny["Temperature"].mean()}')

Average temperature in cities of New York is 10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [27]:
# your code here
temp[temp["Temperature"]>15][["State","City"]]

         State      City
0     New York       NYC
3  Connecticut  Hartford
5   New Jersey    Treton
6   New Jersey    Newark

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [29]:
# your code here
temp[temp["Temperature"]>15][["City"]]

       City
0       NYC
3  Hartford
5    Treton
6    Newark

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [33]:
# your code here
temp[(temp["Temperature"]>15) & (temp["Temperature"]<20)]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [43]:
# your code here
pd.pivot_table(temp,values="Temperature",columns="State",aggfunc=["mean","std"]).T

                  Temperature
     State
mean Connecticut    15.833333
     New Jersey     21.111111
     New York       10.740741
std  Connecticut     1.964186
     New Jersey      1.571348
     New York        8.133404

# [ONLY ONE MANDATORY]  Challenge 2

Download the dataset `employees` from [here](https://drive.google.com/file/d/1CYFlr1Gc-B6nM3LfNUHj0WDNlXnK2ALI/view?usp=sharing) and place it in the data folder.
Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [48]:
# your code here

employees = pd.read_csv("Employee.csv")
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the `employees` dataframe. Comment your results.

In [47]:
# your code here
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [49]:
"""
Only Years and Salary columns has int type which was as expected, rest are object types
"""

'\nOnly Years and Salary columns has int type which was as expected, rest are object types\n'

#### What's the average salary in this company?

In [52]:
# your code here
employees["Salary"].mean()

48.888888888888886

#### What's the highest salary?

In [53]:
# your code here
employees["Salary"].max()

70

#### What's the lowest salary?

In [55]:
# your code here
employees["Salary"].min()

30

#### Who are the employees with the lowest salary?

In [61]:
# your code here
employees[employees["Salary"] == employees["Salary"].min()]

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [69]:
# your code here
employees.iloc[[2],:]

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [77]:
# your code here
employees.loc[[2],["Name","Salary"]]

    Name  Salary
2  David      30

#### Print all the rows where job title is associate.

In [79]:
# your code here
employees[employees["Title"]=="associate"]

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

In [78]:
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [80]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [89]:
# Method 2
# your code here
employees.loc[:2,:]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [92]:
# your code here
employees[(employees["Title"]=="associate") & (employees["Salary"] > 55)]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [99]:
# your code here
pd.pivot_table(employees,values="Salary",columns=["Years","Name"]).T.reset_index()

   Years    Name  Salary
0      1    Jose      35
1      2   David      30
2      2     Eva      55
3      2   Maria      30
4      3  Samuel      55
5      4   Sonia      35
6      7   Pedro      60
7      8     Ana      70
8      8  Carlos      70

####  What is the average salary per title?

In [101]:
# your code here
pd.pivot_table(employees,values="Salary",columns="Title").T

              Salary
Title
VP         70.000000
analyst    32.500000
associate  56.666667

####  Find the salary quartiles.

In [107]:
# your code here
employees.describe().iloc[4:7]

     Years  Salary
25%    2.0    35.0
50%    3.0    55.0
75%    7.0    60.0

#### Is the mean salary different per gender?

In [111]:
# your code here
'''
Yes, it does according to below table.
'''

pd.pivot_table(employees,values="Salary",columns="Gender")

Gender     F     M
Salary  47.5  50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [155]:
numeric_values = list(employees._get_numeric_data().columns)

pd.pivot_table(employees,values=numeric_values,
               columns="Department",aggfunc=["min","mean","max"]).T

                 Salary     Years
     Department
min  HR           30.00  2.000000
     IT           30.00  1.000000
     Sales        55.00  2.000000
mean HR           45.00  4.666667
     IT           48.75  4.500000
     Sales        55.00  2.500000
max  HR           70.00  8.000000
     IT           70.00  8.000000
     Sales        55.00  3.000000

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [139]:
# your code here
max_sal=pd.pivot_table(employees,values="Salary",columns="Department",aggfunc={"Salary":"max"})
min_sal=pd.pivot_table(employees,values="Salary",columns="Department",aggfunc={"Salary":"min"})
max_sal.sub(min_sal)

Department  HR  IT  Sales
Salary      40  40      0

# [ONLY ONE MANDATORY] Challenge 3
Download the dataset `Orders` from [here](https://drive.google.com/file/d/1aG8-IFQXyAYGYBpVSRsiMG-XR0iDRVXN/view?usp=sharing) and place it in the data folder.
Load the `Orders` into a dataframe. Call the dataframe `Orders`.

In [158]:
# your code here
orders = pd.read_csv("Orders.csv")
orders.shape

(397924, 14)

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here